app/Http/Controllers/Frontend/Startup/FounderController.php

select * from `skills`
select * from `grades`
select * from `universities`
---
    public function create()
    {
        // session handle
        if (session()->has('current-step') && session('current-step') > 1) {
            return redirect(route('frontend.startup.register.founder.edit'));
        }

        if (!session()->has('current-step')) {
            session()->put('current-step', 1);
        }

        $data = [];
        $data['skill'] = Skill::all()->split(2);
        $data['grade'] = Grade::all();
        $data['university'] = University::all();

insert into `users` (`name`, `email`, `mobile`, `gender`, `password`, `updated_at`, `created_at`) values ('محمدرضا صادقی', 'sadeghi.dev@outlook.com', '09125888805', 'male', '9fgMkvNNLz', '2019-02-05 10:23:01', '2019-02-05 10:23:01')
---
    public function store(FounderRequest $request)
    {
        // retrieve data
        $firstName = $request->get('first_name');
        $lastName = $request->get('last_name');
        $gradeId = $request->get('grade_id');
        $universityId = $request->get('university_id');
        $major = $request->get('major');
        $email = $request->get('email');
        $mobile = $request->get('mobile');
        $gender = $request->get('gender');
        $soldiershipStatus = $request->get('soldiership_status');
        $skills = $request->get('skills');
        $achievement = $request->get('achievement');

        // user data
        $user = new User();
        $user->name = $firstName . ' ' . $lastName;
        $user->email = $email;
        $user->mobile = $mobile;
        $user->gender = $gender;
        $user->password = str_random('10');
        session()->put('pass', $user->password);
        // TODO ** set password and email **

        $user->save();

insert into `founders` (`user_id`, `first_name`, `last_name`, `grade_id`, `university_id`, `major`, `soldiership_status`, `achievement`, `updated_at`, `created_at`) values (1, 'محمدرضا', 'صادقی', '3', '1', 'تجارت الکترونیک', '1', '', '2019-02-05 10:23:01', '2019-02-05 10:23:01')
insert into `founder_skill` (`founder_id`, `skill_id`) values (1, 5)
---
        $founder->major = $major;
        $founder->soldiership_status = $soldiershipStatus;
        $founder->achievement = $achievement;
        $founder->save();

        // founder skills
        $founder->skills()->sync($skills);

select * from `skills`
select * from `grades`
select * from `universities`
---
    public function edit(Request $request)
    {
        if (!(session()->has('current-step') && session('current-step') > 1)) {
            return redirect()->back();
        }

        $data = [];
        $data['skill'] = Skill::all()->split(2);
        $data['grade'] = Grade::all();
        $data['university'] = University::all();

insert into `founder_skill` (`founder_id`, `skill_id`) values (1, 9)
---
        $founder->save();

        // founder skills
        $founder->skills()->sync($skills);