app/Http/Controllers/Frontend/Startup/StartupController.php

    public function create()
    {
        // session handle
        if (session()->has('current-step') && session('current-step') > 3) {
            return redirect(route('frontend.startup.register.startup.edit'));
        }

        if (!(session()->has('current-step') && session('current-step') == 3)) {
            return $this->_handle();
        }

        $data = [];
        $data['domain'] = Domain::all()->split(4);
        $data['prop'] = Prop::all()->split(4);
---
select * from `domains`
select * from `props`