app/Http/Controllers/Frontend/Startup/TeamController.php

    public function store(TeamRequest $request)
    {
        // retrieve data
        $members = $request->get('members');

        // team data
        $team = new Team();
        $team->background = $request->get('background');
        $team->employees_count = $request->get('employees_count');
        $team->introduction = $request->get('introduction');
        $team->teamwork = $request->get('teamwork');
        $team->description = $request->get('description');
        $team->founder_id = $this->getUser()->founder->id;
        $team->save();
---
insert into `teams` (`background`, `employees_count`, `introduction`, `teamwork`, `description`, `founder_id`, `updated_at`, `created_at`) values ('asd', '5', 'asd', 'asd', 'asd', 1, '2019-02-05 10:38:22', '2019-02-05 10:38:22')